app/controllers/bookjudges_controller.rb

SELECT "bookjudges".* FROM "bookjudges"
---
  def index
    @bookjudges = Bookjudge.all

INSERT INTO "bookjudges" ("title", "author", "isbn", "judge_result", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["author", ""], ["isbn", "4163689400"], ["judge_result", 0], ["created_at", "2015-11-28 05:30:04.614295"], ["updated_at", "2015-11-28 05:30:04.614295"]]
---
  def create
    @bookjudge = Bookjudge.new(bookjudge_params)


    ndl_result = judge_by_ndl @bookjudge
    yunica_result = judge_by_yunica @bookjudge


    #結果生成
    #judge_result
    # 2 ？ NDLにないし他にもない　存在しない本？
    # 1 O NDLにないが他の場所にある
    # 0 X NDLにある
    if ndl_result #ndlにあった
      @bookjudge.judge_result = 0
    elsif !ndl_result && yunica_result #ndlにはない　他の図書館にある
      @bookjudge.judge_result = 1
    else
      @bookjudge.judge_result = 2
    end

    option_str = "NDLの結果: " + ndl_result.to_s + "<br />"
    option_str += "ゆにかねっとの結果: " + yunica_result.to_s + "<br />"

    #返却
    respond_to do |format|
      if @bookjudge.judge_result == 1 && @bookjudge.save

DELETE FROM "bookjudges" WHERE "bookjudges"."id" = ?  [["id", 1]]
---
  def destroy
    @bookjudge.destroy

SELECT  "bookjudges".* FROM "bookjudges" WHERE "bookjudges"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_bookjudge
      @bookjudge = Bookjudge.find(params[:id])